In [1]:
import pymysql
import pandas as pd

## Connect to datbase and read in to a `DataFrame`

In [2]:
conn = pymysql.connect(host='db', port=3306, user='root', passwd='password', db='wikipedia')
df_mysql = pd.read_sql('select * from geo_tags;', con=conn)
conn.close()

## Count

In [3]:
len(df_mysql)

38092

## Top rows

In [4]:
df_mysql.head()

,gt_id,gt_page_id,gt_globe,gt_primary,gt_lat,gt_lon,gt_dim,gt_type,gt_name,gt_country,gt_region
0,89,20941111,b'earth',0,90.00,12.0,10000.0,b'waterbody',b'Arctic Ocean',None,None
1,98,20941111,b'earth',0,63.25,12.0,1000000.0,b'country',b'Norway',None,None
2,109,20941111,b'earth',0,33.00,12.0,1000000.0,b'country',b'Libya',None,None
3,112,20941111,b'earth',0,7.50,12.0,1000000.0,b'country',b'Cameroon',None,None
4,115,20941111,b'earth',0,-2.95,12.0,1000000.0,b'country',b'Gabon',None,None

## Grouping

In [55]:
grouped_series = df_mysql.groupby('gt_page_id').size().sort_values(ascending=False)

grouped_df = pd.DataFrame(index=grouped_series.index.values, data=grouped_series.values, columns=['count'])

grouped_df.head()

          count
2546139     727
12100827    160
12278284    156
12323686    147
12100792    145

In [57]:
grouped_df['url'] = grouped_df.index.map(lambda x: "https://en.wikipedia.org/?curid=" + str(x))
grouped_df.head()

          count                                       url
2546139     727   https://en.wikipedia.org/?curid=2546139
12100827    160  https://en.wikipedia.org/?curid=12100827
12278284    156  https://en.wikipedia.org/?curid=12278284
12323686    147  https://en.wikipedia.org/?curid=12323686
12100792    145  https://en.wikipedia.org/?curid=12100792